Revit 2027 API
ElementStructuralTypeFilter(StructuralType) Constructor
 Constructs a new instance of a filter to match elements by structural type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementStructuralTypeFilter(
	StructuralType structuralType
)
Public Sub New (
	structuralType As StructuralType
)
public:
ElementStructuralTypeFilter(
	StructuralType structuralType
)
new :
        structuralType : StructuralType -> ElementStructuralTypeFilter
Parameters
structuralType StructuralType
 The structural type to match.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElementStructuralTypeFilter Class
ElementStructuralTypeFilter Overload
Autodesk.Revit.DB Namespace